Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::Fitting Class Referencefinal
MEP Element Manager
A fitting is used in distribution systems to connect straight sections of pipes and ducts, adapting to different sizes or shapes. More...
#include <MEPFitting.hpp>
 Inheritance diagram for ACAPI::MEP::Fitting:
 Classes
class  | Modifier
Modifier of the Fitting. More...
 Public Member Functions
FittingDefault  | PickUpDefault () const
Picks up the Default from the Fitting.
Domain  | GetDomain () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< Fitting >  | Get (const UniqueID &uniqueId)
Returns a Fitting.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A fitting is used in distribution systems to connect straight sections of pipes and ducts, adapting to different sizes or shapes.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< Fitting > ACAPI::MEP::Fitting::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a Fitting.
Parameters
uniqueId | The UniqueID of the requested Fitting.
Returns
If the uniqueId belongs to a Fitting, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::Fitting::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the Fitting.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::Fitting::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 FittingDefault ACAPI::MEP::Fitting::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Fitting.
Returns
Returns a FittingDefault with the parameters of the object it was called for.